In [28]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [96]:
df = pd.read_csv('./data/PPFCF/chart.csv',index_col=0,parse_dates=True)

In [97]:
df.head()

,Parag Parikh Flexi Cap Fund - Regular Plan - Growth,$-Adjusted,NIFTY 500 - TRI
DateTime,,,
2013-05-28,10.00,0.1794,6623.80
2013-05-29,10.01,0.1779,6609.41
2013-05-30,10.03,0.1788,6625.94
2013-05-31,10.01,0.1773,6502.47
2013-06-03,10.06,0.1778,6471.69

In [98]:
df.isna().count()

Parag Parikh Flexi Cap Fund - Regular Plan - Growth    2989
$-Adjusted                                             2989
NIFTY 500 - TRI                                        2989
dtype: int64

In [99]:
df.drop('$-Adjusted',axis=1,inplace=True)
df.head()

,Parag Parikh Flexi Cap Fund - Regular Plan - Growth,NIFTY 500 - TRI
DateTime,,
2013-05-28,10.00,6623.80
2013-05-29,10.01,6609.41
2013-05-30,10.03,6625.94
2013-05-31,10.01,6502.47
2013-06-03,10.06,6471.69

In [105]:
df.rename(columns={'Parag Parikh Flexi Cap Fund - Regular Plan - Growth':'NAV',
'NIFTY 500 - TRI':'Nifty500_TRI'},inplace=True)
df.head()

              NAV  Nifty500_TRI
DateTime
2013-05-28  10.00       6623.80
2013-05-29  10.01       6609.41
2013-05-30  10.03       6625.94
2013-05-31  10.01       6502.47
2013-06-03  10.06       6471.69

In [106]:
df.columns = df.columns.str.strip()
df.head()

              NAV  Nifty500_TRI
DateTime
2013-05-28  10.00       6623.80
2013-05-29  10.01       6609.41
2013-05-30  10.03       6625.94
2013-05-31  10.01       6502.47
2013-06-03  10.06       6471.69

In [108]:
df['NAV_normalized']=df['NAV'] / df['NAV'].iloc[0]*10
df['Nft500_TRI_normalized']=df['Nifty500_TRI']/df['Nifty500_TRI'].iloc[0]*10
df.head()

              NAV  Nifty500_TRI  NAV_normalized  Nft500_TRI_normalized
DateTime
2013-05-28  10.00       6623.80           10.00              10.000000
2013-05-29  10.01       6609.41           10.01               9.978275
2013-05-30  10.03       6625.94           10.03              10.003231
2013-05-31  10.01       6502.47           10.01               9.816827
2013-06-03  10.06       6471.69           10.06               9.770358

In [109]:
df['Fund Returns']=df['NAV'].pct_change()
df['Index Returns']=df['Nifty500_TRI'].pct_change()
df.head()

C:\Users\vaish\AppData\Local\Temp\ipykernel_996\3194780914.py:2: FutureWarning: The default fill_method='pad' in Series.pct_change is deprecated and will be removed in a future version. Either fill in any non-leading NA values prior to calling pct_change or specify 'fill_method=None' to not fill NA values.
  df['Index Returns']=df['Nifty500_TRI'].pct_change()

,NAV,Nifty500_TRI,NAV_normalized,Nft500_TRI_normalized,Fund Returns,Index Returns
DateTime,,,,,,
2013-05-28,10.00,6623.80,10.00,10.000000,NaN,NaN
2013-05-29,10.01,6609.41,10.01,9.978275,0.001000,-0.002172
2013-05-30,10.03,6625.94,10.03,10.003231,0.001998,0.002501
2013-05-31,10.01,6502.47,10.01,9.816827,-0.001994,-0.018634
2013-06-03,10.06,6471.69,10.06,9.770358,0.004995,-0.004734

In [113]:
beta=df['Fund Returns'].cov(df['Index Returns'])/df['Index Returns'].var()
print(beta)

0.592270909168079

In [114]:
alpha=df['Fund Returns']-beta*df['Index Returns']
print(alpha)

DateTime
2013-05-28         NaN
2013-05-29    0.002287
2013-05-30    0.000517
2013-05-31    0.009043
2013-06-03    0.007799
                ...
2025-07-14    0.001573
2025-07-15   -0.002501
2025-07-16   -0.000743
2025-07-17    0.000504
2025-07-18   -0.000822
Length: 2989, dtype: float64